# pandas DataFrame

## Setup

In [1]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

### Create Simple DataFrame

In [3]:
mda = np.array([
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ])
df1 = pd.DataFrame(mda)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df1.columns=['A','B','C']
df1.index=np.arange(1,len(df1)+1)
df1

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [5]:
df2 = pd.DataFrame( mda, columns=['A','B','C'], index=np.arange(1,len(mda)+1) )
df2

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

### Create DataFrame using Series as Rows

In [8]:
people = pd.Series(['Adam','Bonnie','Carlos','David'], index=['A','B','C','D'])
places = pd.Series(['Africa','Berlin','Canada'], index=['A','B','C'])
things = pd.Series(['Apple','Baseball bat','Car'], index=['A','B','C'])

df3 = pd.DataFrame([people, places, things])

df3

        A             B       C      D
0    Adam        Bonnie  Carlos  David
1  Africa        Berlin  Canada    NaN
2   Apple  Baseball bat     Car    NaN

In [9]:
df4 = pd.DataFrame([people, places, things],
                  index = ['People','Place','Thing'],
                  columns = ['A','B','D'])
df4

             A             B      D
People    Adam        Bonnie  David
Place   Africa        Berlin    NaN
Thing    Apple  Baseball bat    NaN

### Create DataFrame using concat()

In [10]:
np.random.seed(1)
ar1 = np.random.choice(['A','B','C','D','F'], 100, p=[.2,.4,.3,.08,.02])
ar2 = np.random.choice(['A','B','C','D','F'], 50, p=[.3,.4,.2,.1,0])
ar3 = np.random.choice(['a','b','c','d','f'], 200, p=[.15,.45,.25,.13,.02])
s1 = pd.Series(ar1)
s2 = pd.Series(ar2)
s3 = pd.Series(ar3)
df5 = pd.concat([s1,s2,s3], axis=1)
df5.columns=['grades1','grades2','grades3']
df5

    grades1 grades2 grades3
0         B       B       a
1         C       B       d
2         A       C       b
3         B       B       b
4         A       D       b
..      ...     ...     ...
195     NaN     NaN       c
196     NaN     NaN       c
197     NaN     NaN       c
198     NaN     NaN       c
199     NaN     NaN       a

[200 rows x 3 columns]

### Create DataFrame from CSV

In [11]:
csv ='../csvs/us-population-2010-2014.csv'
pops = pd.read_csv(csv, usecols=[0,1,5,6])
pops

    SEX  AGE POPESTIMATE2013 POPESTIMATE2014
0     A    0       3,945,610       3,948,350
1     A    1       3,943,077       3,962,123
2     A    2       3,992,690       3,957,772
3     A    3       3,992,425       4,005,190
4     A    4       3,994,047       4,003,448
..   ..  ...             ...             ...
298   F   96          82,067          89,949
299   F   97          61,693          63,252
300   F   98          44,703          46,536
301   F   99          31,378          32,791
302   F  100          54,379          58,468

[303 rows x 4 columns]

### Column Names and Row index

In [12]:
pops.columns

Index(['SEX', 'AGE', 'POPESTIMATE2013', 'POPESTIMATE2014'], dtype='object')

In [13]:
pops.index

RangeIndex(start=0, stop=303, step=1)

### Shape

In [14]:
pops.shape

(303, 4)

### Number of Columns and Rows

In [15]:
num_rows = len(pops)
num_cols = len(pops.columns)
num_rows, num_cols

(303, 4)

### head() and tail()

In [16]:
pops.head()

  SEX  AGE POPESTIMATE2013 POPESTIMATE2014
0   A    0       3,945,610       3,948,350
1   A    1       3,943,077       3,962,123
2   A    2       3,992,690       3,957,772
3   A    3       3,992,425       4,005,190
4   A    4       3,994,047       4,003,448

In [17]:
pops.tail()

    SEX  AGE POPESTIMATE2013 POPESTIMATE2014
298   F   96          82,067          89,949
299   F   97          61,693          63,252
300   F   98          44,703          46,536
301   F   99          31,378          32,791
302   F  100          54,379          58,468

In [24]:
pops.describe(include='all')

        SEX    AGE  POPESTIMATE2013  POPESTIMATE2014
count   303  303.0     3.030000e+02     3.030000e+02
unique    3    NaN              NaN              NaN
top       A    NaN              NaN              NaN
freq    101    NaN              NaN              NaN
mean    NaN   50.0     2.089093e+06     2.104667e+06
...     ...    ...              ...              ...
min     NaN    0.0     8.228000e+03     9.037000e+03
25%     NaN   25.0     1.110254e+06     1.151440e+06
50%     NaN   50.0     2.047481e+06     2.053539e+06
75%     NaN   75.0     2.309066e+06     2.324046e+06
max     NaN  100.0     4.666392e+06     4.698584e+06

[11 rows x 4 columns]

### Accessing Columns

In [20]:
pops['POPESTIMATE2014']

0      3,948,350
1      3,962,123
2      3,957,772
3      4,005,190
4      4,003,448
         ...
298       89,949
299       63,252
300       46,536
301       32,791
302       58,468
Name: POPESTIMATE2014, Length: 303, dtype: object

In [21]:
pops.POPESTIMATE2014

0      3,948,350
1      3,962,123
2      3,957,772
3      4,005,190
4      4,003,448
         ...
298       89,949
299       63,252
300       46,536
301       32,791
302       58,468
Name: POPESTIMATE2014, Length: 303, dtype: object

In [22]:
pops[['AGE','SEX','POPESTIMATE2014']]

     AGE SEX POPESTIMATE2014
0      0   A       3,948,350
1      1   A       3,962,123
2      2   A       3,957,772
3      3   A       4,005,190
4      4   A       4,003,448
..   ...  ..             ...
298   96   F          89,949
299   97   F          63,252
300   98   F          46,536
301   99   F          32,791
302  100   F          58,468

[303 rows x 3 columns]

### Fix Numbers

In [23]:
def fix_num(num):
    if isinstance(num,str):
        return int(num.replace(',', ''))
    else:
        return num

pops.POPESTIMATE2013 = pops.POPESTIMATE2013.apply(fix_num)
pops.POPESTIMATE2014 = pops.POPESTIMATE2014.apply(fix_num)
pops

    SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
0     A    0          3945610          3948350
1     A    1          3943077          3962123
2     A    2          3992690          3957772
3     A    3          3992425          4005190
4     A    4          3994047          4003448
..   ..  ...              ...              ...
298   F   96            82067            89949
299   F   97            61693            63252
300   F   98            44703            46536
301   F   99            31378            32791
302   F  100            54379            58468

[303 rows x 4 columns]

In [25]:
pops.POPESTIMATE2014.sum()

637714112

In [28]:
'{:,}'.format( pops.POPESTIMATE2014.sum() )

'637,714,112'

In [36]:
pops.iloc[[4]]

  SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
4   A    4          3994047          4003448

### Using a column as the index

In [ ]:
csv ='../csvs/mantle.csv'
mantle = pd.read_csv(csv, usecols=[0,1,2,3,4,5,6], index_col=['Year'])
mantle

In [37]:
pops

    SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
0     A    0          3945610          3948350
1     A    1          3943077          3962123
2     A    2          3992690          3957772
3     A    3          3992425          4005190
4     A    4          3994047          4003448
..   ..  ...              ...              ...
298   F   96            82067            89949
299   F   97            61693            63252
300   F   98            44703            46536
301   F   99            31378            32791
302   F  100            54379            58468

[303 rows x 4 columns]

### Changing the index

In [41]:
pops['SEX_AGE'] = pops['SEX'] + pops['AGE'].apply(str)
pops.set_index('SEX_AGE', inplace=True)
pops

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
A0        A    0          3945610          3948350
A1        A    1          3943077          3962123
A2        A    2          3992690          3957772
A3        A    3          3992425          4005190
A4        A    4          3994047          4003448
...      ..  ...              ...              ...
F96       F   96            82067            89949
F97       F   97            61693            63252
F98       F   98            44703            46536
F99       F   99            31378            32791
F100      F  100            54379            58468

[303 rows x 4 columns]

### Accessing Rows

In [42]:
pops.loc['A25']

SEX                      A
AGE                     25
POPESTIMATE2013    4377385
POPESTIMATE2014    4509594
Name: A25, dtype: object

In [43]:
pops.loc[['F25','M25','A25']]

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
F25       F   25          2149579          2213758
M25       M   25          2227806          2295836
A25       A   25          4377385          4509594

In [44]:
pops.loc['A20':'A29']

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
A20       A   20          4459958          4418887
A21       A   21          4580949          4489746
A22       A   22          4666392          4612322
A23       A   23          4661403          4698584
A24       A   24          4479243          4692635
A25       A   25          4377385          4509594
A26       A   26          4305217          4406472
A27       A   27          4326704          4332545
A28       A   28          4364812          4351851
A29       A   29          4230048          4387476

In [45]:
pops.iloc[4]

SEX                      A
AGE                      4
POPESTIMATE2013    3994047
POPESTIMATE2014    4003448
Name: A4, dtype: object

In [46]:
pops.iloc[[0,1,2,-3,-2,-1]]

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
A0        A    0          3945610          3948350
A1        A    1          3943077          3962123
A2        A    2          3992690          3957772
F98       F   98            44703            46536
F99       F   99            31378            32791
F100      F  100            54379            58468

In [47]:
pops.iloc[:5]

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
A0        A    0          3945610          3948350
A1        A    1          3943077          3962123
A2        A    2          3992690          3957772
A3        A    3          3992425          4005190
A4        A    4          3994047          4003448

### Combining Row and Column Selection

In [51]:
first5rows = pops.iloc[:5]
first5rows,type(first5rows)

(        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
 SEX_AGE
 A0        A    0          3945610          3948350
 A1        A    1          3943077          3962123
 A2        A    2          3992690          3957772
 A3        A    3          3992425          4005190
 A4        A    4          3994047          4003448,
 pandas.core.frame.DataFrame)

#### Two Steps - Rows First

In [52]:
first5rows = pops.iloc[:5]
first5rows[['POPESTIMATE2013']]

         POPESTIMATE2013
SEX_AGE
A0               3945610
A1               3943077
A2               3992690
A3               3992425
A4               3994047

#### Two Steps - Columns First

In [53]:
pop2013 = pops[['POPESTIMATE2013']]
pop2013.iloc[:5]

         POPESTIMATE2013
SEX_AGE
A0               3945610
A1               3943077
A2               3992690
A3               3992425
A4               3994047

#### One Step - Rows First

In [54]:
pops.iloc[:5][['POPESTIMATE2013']]

         POPESTIMATE2013
SEX_AGE
A0               3945610
A1               3943077
A2               3992690
A3               3992425
A4               3994047

#### One Step - Columns First

In [55]:
pops[['POPESTIMATE2013']].iloc[:5]

         POPESTIMATE2013
SEX_AGE
A0               3945610
A1               3943077
A2               3992690
A3               3992425
A4               3994047

#### Getting a Series

In [56]:
pops.iloc[:5]['POPESTIMATE2013']

SEX_AGE
A0    3945610
A1    3943077
A2    3992690
A3    3992425
A4    3994047
Name: POPESTIMATE2013, dtype: int64

In [57]:
pops.iloc[:5].POPESTIMATE2013

SEX_AGE
A0    3945610
A1    3943077
A2    3992690
A3    3992425
A4    3994047
Name: POPESTIMATE2013, dtype: int64

In [58]:
pops['POPESTIMATE2013'].iloc[:5]

SEX_AGE
A0    3945610
A1    3943077
A2    3992690
A3    3992425
A4    3994047
Name: POPESTIMATE2013, dtype: int64

In [59]:
pops.POPESTIMATE2013.iloc[:5]

SEX_AGE
A0    3945610
A1    3943077
A2    3992690
A3    3992425
A4    3994047
Name: POPESTIMATE2013, dtype: int64

### Math on a DataFrame vs. a Series

In [60]:
pops.iloc[:5][['POPESTIMATE2013']].mean()

POPESTIMATE2013    3973569.8
dtype: float64

In [61]:
pops.iloc[:5]['POPESTIMATE2013'].mean()

3973569.8

In [62]:
pops.iloc[:5][['POPESTIMATE2013','POPESTIMATE2014']].mean()

POPESTIMATE2013    3973569.8
POPESTIMATE2014    3975376.6
dtype: float64

### Getting Specific Data

In [63]:
pops.at['F40','POPESTIMATE2014']

1940627

In [64]:
pops.iat[41,3]

3917413

### Boolean Selection

In [65]:
pops[pops.SEX == 'F']

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
F0        F    0          1930073          1930493
F1        F    1          1927725          1938870
F2        F    2          1950168          1935270
F3        F    3          1954340          1956572
F4        F    4          1956094          1959950
...      ..  ...              ...              ...
F96       F   96            82067            89949
F97       F   97            61693            63252
F98       F   98            44703            46536
F99       F   99            31378            32791
F100      F  100            54379            58468

[101 rows x 4 columns]

In [66]:
pops[(pops.SEX == 'F') | (pops.SEX == 'M')]

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
M0        M    0          2015537          2017857
M1        M    1          2015352          2023253
M2        M    2          2042522          2022502
M3        M    3          2038085          2048618
M4        M    4          2037953          2043498
...      ..  ...              ...              ...
F96       F   96            82067            89949
F97       F   97            61693            63252
F98       F   98            44703            46536
F99       F   99            31378            32791
F100      F  100            54379            58468

[202 rows x 4 columns]

In [67]:
pops[(pops.SEX == 'F') & (pops.AGE > 65)]

        SEX  AGE  POPESTIMATE2013  POPESTIMATE2014
SEX_AGE
F66       F   66          1850730          1758649
F67       F   67          1376207          1832245
F68       F   68          1364098          1361047
F69       F   69          1335136          1347458
F70       F   70          1370786          1317238
...      ..  ...              ...              ...
F96       F   96            82067            89949
F97       F   97            61693            63252
F98       F   98            44703            46536
F99       F   99            31378            32791
F100      F  100            54379            58468

[35 rows x 4 columns]

### Filtering a DataFrame with a Boolean Series

In [69]:
males2013 = pops[pops.SEX == 'M'].POPESTIMATE2013
females2013 = pops[pops.SEX == 'F'].POPESTIMATE2013

#Make sure Series are alignable
males2013.index = np.arange(0,len(males2013))
females2013.index = np.arange(0,len(females2013))

males = pops[pops.SEX == 'M'].POPESTIMATE2013
males.index = np.arange(0,len(males))
males[males2013 < females2013]

35     2001196
36     1976017
37     1919755
38     1983827
39     1915150
        ...
96       27630
97       18831
98       12750
99        8228
100      12369
Name: POPESTIMATE2013, Length: 66, dtype: int64

CSV Source: Vintage 2014 National Population Datasets

https://www.census.gov/popest/data/national/asrh/2014/files/NC-EST2014-AGESEX-RES.csv